In [10]:
import warnings
warnings.filterwarnings('ignore')

import pandas as pd
import numpy as np

# 데이터 분석 입문자를 위한 파이썬 판다스 300제
https://wikidocs.net/89378  

# DataManim - 빅데이터 분석기사 실기 문제 연습
https://www.datamanim.com/dataset/03_dataq/typeone.html#id2

# 1. Jupyer Notebook 단축키
- a : 위에 새로운 셀 추가
- b : 아래에 새로운 셀 추가
- m : Markdown으로 변경
> # # 21
> ## ## 21-1
- y : Code로 변경
- dd: 셀 삭제
---
- Ctrl + Enter : 입력 셀 실행 
- Shift + Enter : 입력 셀 실행 후 아래 셀로 이동 (없으면 새로운 셀 추가)
- Alt + Enter : 입력영역 실행 후 아래 새로운 영역 추가

# 2. Pandas 기본

## 2.1. 데이터 기본 구조
- pd.Series
- pd.DataFrame

In [11]:
series = pd.Series({'a': 1, 'b': 2}, name='test')
series

a    1
b    2
Name: test, dtype: int64

In [16]:
series.index
series.values
series.name

'test'

In [21]:
df = pd.DataFrame([[1, 6], [2, 7], [3, 8], [4, 9]], columns=['a', 'b'])
df

   a  b
0  1  6
1  2  7
2  3  8
3  4  9

In [20]:
df.columns

Index(['a', 'b'], dtype='object')

In [17]:
df = pd.DataFrame({'a': [1, 2, 3, 4], 'b': [6, 7, 8, 9]})
df

   a  b
0  1  6
1  2  7
2  3  8
3  4  9

## 2.2 데이터 로드 / 확인

In [25]:
df = pd.read_csv('dataset/penguins.csv')

In [31]:
df.head(2)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female

In [35]:
df.shape

(344, 7)

In [36]:
len(df)

344

## 2.3 DataFrame Indexing
- df[]
- df.loc[] : location
- df.iloc[] : Integer location

In [39]:
df.head(2)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female

In [66]:
df['bill_length_mm'].std()

5.4595837139265315

In [61]:
df.loc[:5, 'island']

0    Torgersen
1    Torgersen
2    Torgersen
3    Torgersen
4    Torgersen
5    Torgersen
Name: island, dtype: object

In [67]:
df.iloc[:5, 1]

0    Torgersen
1    Torgersen
2    Torgersen
3    Torgersen
4    Torgersen
Name: island, dtype: object

In [68]:
df['new_column'] = np.nan

In [69]:
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,new_column
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male,NaN
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female,NaN
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female,NaN
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female,NaN

# 연습문제
# bill_depth_mm 컬럼을 cm로 변환해서 
# bill_depth_cm라는 새로운 컬럼 생성

In [71]:
df['bill_depth_cm'] = df['bill_depth_mm'] / 10

## filter

In [73]:
df = pd.get_dummies(df, columns=['island'])

In [75]:
df.filter(regex='_mm$')

     bill_length_mm  bill_depth_mm  flipper_length_mm
0              39.1           18.7              181.0
1              39.5           17.4              186.0
2              40.3           18.0              195.0
3               NaN            NaN                NaN
4              36.7           19.3              193.0
..              ...            ...                ...
339             NaN            NaN                NaN
340            46.8           14.3              215.0
341            50.4           15.7              222.0
342            45.2           14.8              212.0
343            49.9           16.1              213.0

[344 rows x 3 columns]

In [76]:
df = pd.read_csv('dataset/penguins.csv')

## Q2-3-1.
## 섬유 (flipper) 길이가 200보다 큰 펭귄의 종(species)과 섬유 길이(flipper_length_mm)를 출력하세요.

In [81]:
df.loc[df['flipper_length_mm'] > 200, \
       ['species', 'flipper_length_mm']]

    species  flipper_length_mm
90   Adelie              202.0
91   Adelie              205.0
95   Adelie              208.0
101  Adelie              203.0
123  Adelie              202.0
..      ...                ...
338  Gentoo              214.0
340  Gentoo              215.0
341  Gentoo              222.0
342  Gentoo              212.0
343  Gentoo              213.0

[148 rows x 2 columns]

## Q2-3-2.
## 펭귄 중에서 흑백 펭귄(species가 'Adelie'인 펭귄)의 평균 몸무게를 구하세요.

In [85]:
df[df['species'] == 'Adelie']['body_mass_g'].mean().round(2)

3700.66

In [91]:
df.loc[df['species'] == 'Adelie', 'body_mass_g'].mean().round(2)

3700.66

In [86]:
t = 123.4566

In [88]:
round(t, 2)

123.46

In [92]:
a = [1.33444, 2.3443]

In [96]:
np.mean(a)

1.8393700000000002

## Q2-3-3.
## 부리 길이(bill_length_mm)가 가장 짧은 펭귄의 종(species)을 찾고, 
## 해당 펭귄의 부리 길이(bill_length_mm)와 섬유 길이(flipper_length_mm)를 출력하세요

In [105]:
spe = df[df['bill_length_mm'] == df['bill_length_mm'].min()]\
            ['species'].values[0]
spe

'Adelie'

In [106]:
df.loc[df['species'] == spe,\
       ['bill_length_mm', 'flipper_length_mm']]

     bill_length_mm  flipper_length_mm
0              39.1              181.0
1              39.5              186.0
2              40.3              195.0
3               NaN                NaN
4              36.7              193.0
..              ...                ...
147            36.6              184.0
148            36.0              195.0
149            37.8              193.0
150            36.0              187.0
151            41.5              201.0

[152 rows x 2 columns]

## 2.4 drop, rename, astype, set_index(), reset_index()

In [121]:
df = df.drop(columns=['species', 'island'])

In [127]:
df = pd.read_csv('dataset/penguins.csv')

In [129]:
df['test'] = '1'

In [136]:
df['test'] = df['test'].astype(int)

In [142]:
test = df[df['bill_length_mm'] > 40].set_index('island')

In [149]:
test = test.reset_index()

In [150]:
test.columns

Index(['island', 'species', 'bill_length_mm', 'bill_depth_mm',
       'flipper_length_mm', 'body_mass_g', 'sex', 'test'],
      dtype='object')

## 2-5. Lv2 검정에서 자주 사용하는 것

## Q1. 각 펭귄 종(species)의 종류를 나열하세요.

In [151]:
df = pd.read_csv('dataset/penguins.csv')

In [152]:
df['species'].unique()

array(['Adelie', 'Chinstrap', 'Gentoo'], dtype=object)

## Q2. 데이터셋에 있는 펭귄 종(species)의 총 개수를 출력하세요.

In [155]:
len(df['species'].unique())

3

In [156]:
df['species'].nunique()

3

## Q3. 몸무게(body_mass_g)가 가장 큰 펭귄의 인덱스를 찾으세요.

In [159]:
df[df['body_mass_g'] == df['body_mass_g'].max()].index[0]

237

In [162]:
df['body_mass_g'].idxmax()

237

## Q4.  펭귄이 발견된 섬(island)의 값의 빈도를 계산하여 각 섬에 몇 마리의 펭귄이 발견되었는지를 출력하세요. + 비율출력

In [165]:
df['island'].value_counts()

Biscoe       168
Dream        124
Torgersen     52
Name: island, dtype: int64

In [166]:
df['island'].value_counts(normalize=True)

Biscoe       0.488372
Dream        0.360465
Torgersen    0.151163
Name: island, dtype: float64

# 3. 데이터 정제와 응용

## 3-1. 조건부 필터링

In [167]:
df = pd.read_csv('dataset/titanic.csv')

In [169]:
df.head(1)

,passengerId,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

# and > &
# or > |
# not > ~

## Q1. age가 30세 이상인 승객들의 데이터를 필터링하세요.

In [170]:
df[df['age'] >= 30]

,passengerId,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## Q2. gender가 female인 승객들 중 생존한(survived:1) 승객들의 데이터를 필터링하세요.

In [174]:
df[(df['gender'] == 'female') & (df['survived'] == 1)]

,passengerId,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S

## Q3. pclass가 1이 아니거나 embarked가 C인 데이터를 필터링하세요.

In [175]:
df[(df['pclass'] != 1) | (df['embarked'] == 'C')]

,passengerId,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# Q4. passengerId가  5의배수 인것을 df1, 아닌 것을 df2로 선언하세요.

In [179]:
Train06 = df[df['passengerId'] % 5 == 0]
Test06 = df[df['passengerId'] % 5 != 0]
display(Train06.shape, Test06.shape)

(178, 12)

(713, 12)

## 3-2. 특정값 포함여부 필터링
- isin()

In [181]:
df['embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [185]:
df[df['embarked'].isin(['S', 'C'])]
df[~df['embarked'].isin(['S', 'C'])]

,passengerId,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
32,33,1,3,"Glynn, Miss. Mary Agatha",female,NaN,0,0,335677,7.7500,NaN,Q

## 3-3. 결측값 필터링
- isna()

In [187]:
df.isna().sum()

passengerId      0
survived         0
pclass           0
name             0
gender           0
age            177
sibsp            0
parch            0
ticket           0
fare             0
cabin          687
embarked         2
dtype: int64

## 3-4. 특정 문자가 포함된 데이터 필터링
- str.contains()

In [196]:
df[df['name'].str.contains('Miss.')]

,passengerId,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
866,867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

## Q1. 1등석 또는 2등석(pclass)에 탄 승객 중에서 나이(age)의 결측값이 있는 승객들의 데이터를 필터링하세요.

In [199]:
df[(df['pclass'].isin([1, 2])) & (df['age'].isna())].head(1)

,passengerId,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0,NaN,S

##  Q2. 20세 미만이거나 60세 이상인 승객들 중에서 "Mr."를 포함하는 이름을 가진 승객의 데이터를 필터링하세요.

In [203]:
df[( (df['age'] < 20) | (df['age'] >=60) )\
   & (df['name'].str.contains('Mr.', regex=False))]

,passengerId,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
67,68,0,3,"Crease, Mr. Ernest James",male,19.0,0,0,S.P. 3464,8.1583,NaN,S
86,87,0,3,"Ford, Mr. William Neal",male,16.0,1,3,W./C. 6608,34.3750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
834,835,0,3,"Allum, Mr. Owen George",male,18.0,0,0,2223,8.3000,NaN,S
841,842,0,2,"Mudd, Mr. Thomas Charles",male,16.0,0,0,S.O./P.P. 3,10.5000,NaN,S
844,845,0,3,"Culumovic, Mr. Jeso",male,17.0,0,0,315090,8.6625,NaN,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S

## 3-5. 정렬
- sort_values()

In [204]:
df = pd.read_csv('dataset/titanic.csv')

In [211]:
df.sort_values(by=['pclass', 'fare'], ascending=[True, False])

,passengerId,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
...,...,...,...,...,...,...,...,...,...,...,...,...
378,379,0,3,"Betros, Mr. Tannous",male,20.0,0,0,2648,4.0125,NaN,C
179,180,0,3,"Leonard, Mr. Lionel",male,36.0,0,0,LINE,0.0000,NaN,S
271,272,1,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0000,NaN,S
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0000,NaN,S
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0000,NaN,S

## 3-6. 결측치 처리
- df.dropna()
- df.fillna()

In [212]:
df.isna().sum()

passengerId      0
survived         0
pclass           0
name             0
gender           0
age            177
sibsp            0
parch            0
ticket           0
fare             0
cabin          687
embarked         2
dtype: int64

In [221]:
df.dropna(subset=['age']).head(1)

,passengerId,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [226]:
df['age'].mean()

29.69911764705882

In [227]:
df['age'].fillna(value=1)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     1.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [230]:
test = pd.DataFrame({'a': [1, np.nan, 3, 4], 'b': [np.nan, 5, 6, np.nan]})
test

     a    b
0  1.0  NaN
1  NaN  5.0
2  3.0  6.0
3  4.0  NaN

In [236]:
test['b'] = test['b'].fillna(method='bfill')

In [238]:
test.isna().sum()

a    1
b    1
dtype: int64

## 3-7. 문자열 처리
- str[]
- str.split()
- str.replace()

In [107]:
df = pd.read_csv('dataset/titanic.csv')

In [249]:
test = pd.DataFrame({'date': ['2023-03-07', '2023-03-18', '2019-01-01']})
test

         date
0  2023-03-07
1  2023-03-18
2  2019-01-01

In [257]:
test['year'] = test['date'].str[:4].astype(int)
test['month'] = test['date'].str[5:7].astype(int)
test['day'] = test['date'].str[-2:].astype(int)
test

         date  year  month  day
0  2023-03-07  2023      3    7
1  2023-03-18  2023      3   18
2  2019-01-01  2019      1    1

In [258]:
test.dtypes

date     object
year      int32
month     int32
day       int32
dtype: object

In [269]:
df[['first_name', 'last_name']] = df['name'].str.split(',', expand=True)

In [270]:
test = df[['name', 'first_name', 'last_name']].head()
test

,name,first_name,last_name
0,"Braund, Mr. Owen Harris",Braund,Mr. Owen Harris
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,"Heikkinen, Miss. Laina",Heikkinen,Miss. Laina
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,"Allen, Mr. William Henry",Allen,Mr. William Henry

In [274]:
test['last_name'].str.lstrip()[0]

'Mr. Owen Harris'

## Q1. last_name에서 .앞에 있는 단어을 호칭(title) 컬럼으로 정의하고, 호칭의 고유값을 확인해보세요.

In [281]:
test['title'] = test['last_name'].str.strip().str.split('.').str[0]

In [284]:
test['title'].value_counts()

Mrs     2
Mr      2
Miss    1
Name: title, dtype: int64

### replace

In [289]:
test['last_name'].str.replace('Mr.', '미스터')

0                                미스터 Owen Harris
1     미스터. John Bradley (Florence Briggs Thayer)
2                                    Miss. Laina
3             미스터. Jacques Heath (Lily May Peel)
4                              미스터 William Henry
Name: last_name, dtype: object

In [293]:
test['title'].replace({'Mr': '미스터', 'Mrs': 'AA'})

0     미스터
1      AA
2    Miss
3      AA
4     미스터
Name: title, dtype: object

# 4. 데이터 병합
- pd.concat : 단순연결
- pd.merge : 특정 key로 결합

## 4-1. pd.concat

In [294]:
df1 = pd.DataFrame({'a': [1, 2, 3, 4], 'b': [0, 0, 0, 0]})
df2 = pd.DataFrame({'a': [1, 2], 'b': [3, 4], 'c': [5, 6]})
df3 = pd.DataFrame({'d': ['test1', 'test2', 'test3'], 'e': ['test1', 'test2', 'test3']})
display(df1, df2, df3)

   a  b
0  1  0
1  2  0
2  3  0
3  4  0

   a  b  c
0  1  3  5
1  2  4  6

       d      e
0  test1  test1
1  test2  test2
2  test3  test3

In [304]:
pd.concat([df1, df2], axis=1, ignore_index=True)

   0  1    2    3    4
0  1  0  1.0  3.0  5.0
1  2  0  2.0  4.0  6.0
2  3  0  NaN  NaN  NaN
3  4  0  NaN  NaN  NaN

## 4-2. pd.merge

In [312]:
df1 = pd.DataFrame({'ID': [1, 2, 3, 4],
                    'Name': ['Alice', 'Bob', 'Charlie', 'David']})

df2 = pd.DataFrame({'아이디': [3, 4, 5, 6],
                    'Age': [25, 30, 35, 40]})

display(df1, df2)

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David

   아이디  Age
0    3   25
1    4   30
2    5   35
3    6   40

In [315]:
pd.merge(df1, df2, left_index=True, right_index=True, how='outer')

   ID     Name  아이디  Age
0   1    Alice    3   25
1   2      Bob    4   30
2   3  Charlie    5   35
3   4    David    6   40

In [308]:
display(df1, df2)

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David

   ID  Age
0   3   25
1   4   30
2   5   35
3   6   40